docs/teaching/8320/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-18 Wed 16:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Math 8820 (Algebraic curves), Fall 2017</title>
<meta name="author" content="Anand Deopurkar" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/main.css"></link><link href="https://fonts.googleapis.com/css?family=Lato:400,400i,700,700i" rel="stylesheet"></link></head>
<body>
<div id="content" class="content">
<h1 class="title">Math 8820 (Algebraic curves), Fall 2017</h1>
<p>
The goal of the class is to learn the theory of complex algebraic curves or Riemann surfaces.
We will use Rick Miranda&rsquo;s book titled &ldquo;Algebraic curves and Riemann surfaces.&rdquo;
The calendar below shows the tentative plan of the course.
As we get to the end of this plan, we can decide upon what to do next based on what strikes our fancy.
Possible further topics include:
</p>

<ol class="org-ol">
<li>Singular curves and degeneration techniques.</li>
<li>Moduli spaces.</li>
<li>Curves over finite fields and the Weil conjectures.</li>
</ol>

<p>
Here is the <a href="syllabus.pdf">official course syllabus</a>.
</p>

<div id="outline-container-org2f3f6cf" class="outline-2">
<h2 id="org2f3f6cf">Notes</h2>
<div class="outline-text-2" id="text-org2f3f6cf">
<p>
I will post the notes that I prepare for the lectures; these may or may not end up being what we discuss in class!
</p>

<ol class="org-ol">
<li><a href="Aug15.pdf">Aug 15, Definitions, basic examples</a></li>
<li><a href="Aug17.pdf">Aug 17, Affine and projective plane curves, hyperelliptic curves</a></li>
<li><a href="Aug22.pdf">Aug 22, Holomorphic functions and maps, Riemann-Hurwitz</a></li>
<li><a href="Aug24.pdf">Aug 24, Meromorphic functions</a></li>
<li><a href="Aug29.pdf">Aug 29, Divisors and line bundles</a></li>
<li><a href="Aug31.pdf">Aug 31, Canonical divisors</a></li>
<li><a href="Sep05.pdf">Sep 05, Line bundles and maps to projective space</a></li>
<li><a href="Sep07.pdf">Sep 07, Cech cohomology of sheaves</a></li>
<li><a href="Sep14.pdf">Sep 15, Cech cohomology continued</a></li>
<li><a href="Sep19.pdf">Sep 19, Invertible sheaves</a></li>
<li><a href="Sep21.pdf">Sep 21, Linear systems, embeddings</a></li>
<li><a href="Sep26.pdf">Sep 26, Linear systems, examples</a></li>
<li><a href="Sep28.pdf">Sep 28, Rational normal curves, Riemann&#x2013;Roch</a></li>
<li><a href="Oct05.pdf">Oct 5,  Low genus curves</a></li>
<li><a href="Oct10.pdf">Oct 10, The canonical embedding, geometric Riemann-Roch</a></li>
<li><a href="Oct12.pdf">Oct 12, Branched coverings and monodromy</a></li>
<li><a href="RR.pdf">Oct 17, Ample divisors, Serre vanishing</a></li>
<li><a href="RR.pdf">Oct 19, Vanishing, order of growth, field of meromorphic functions</a></li>
<li><a href="RR.pdf">Oct 24, Laurent tails, residue pairing</a></li>
<li><a href="RR.pdf">Oct 26, Serre duality</a></li>
<li><a href="Oct31.pdf">Oct 31, Inflection, ramification, Weierstrass points</a></li>
</ol>
</div>
</div>

<div id="outline-container-org5fe9cc4" class="outline-2">
<h2 id="org5fe9cc4">Homework</h2>
<div class="outline-text-2" id="text-org5fe9cc4">
<p>
Work out the problems in enough detail to convince yourself that you understand what is going on, but you need not turn in any write-up, unless you require a grade.
If you require a grade, then you must write up complete solutions to at least 20 problems over the course of the semester.
</p>

<ol class="org-ol">
<li><a href="hw1.pdf">Homework 1</a></li>
<li><a href="hw2.pdf">Howework 2</a></li>
<li><a href="hw3.pdf">Homework 3</a></li>
<li><a href="hw4.pdf">Homework 4</a></li>
<li><a href="hw5.pdf">Homework 5</a></li>
</ol>
</div>
</div>

<div id="outline-container-orgf82f641" class="outline-2">
<h2 id="orgf82f641">Calendar</h2>
<div class="outline-text-2" id="text-orgf82f641">
<p>
Used to have a google calendar; now defunct.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
Created by <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15).  Last modified: 2022-05-31 Tue 15:55.  <a href="https://github.com/deopurkar/deopurkar.github.io">Source</a>
</div>
</body>
</html>
